garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC6POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC6POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE5A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC6G1POL" edc:desc="" edc:mask="0x1" edc:name="LC6G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G2POL" edc:desc="" edc:mask="0x1" edc:name="LC6G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G3POL" edc:desc="" edc:mask="0x1" edc:name="LC6G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G4POL" edc:desc="" edc:mask="0x1" edc:name="LC6G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC6POL" edc:desc="" edc:mask="0x1" edc:name="LC6POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC6SEL0" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC6SEL0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE5B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0xff" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC6D1S" edc:mask="0xff" edc:name="LC6D1S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S5" edc:desc="" edc:mask="0x1" edc:name="D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S6" edc:desc="" edc:mask="0x1" edc:name="D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S7" edc:desc="" edc:mask="0x1" edc:name="D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC6D1S0" edc:mask="0x1" edc:name="LC6D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D1S1" edc:mask="0x1" edc:name="LC6D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D1S2" edc:mask="0x1" edc:name="LC6D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D1S3" edc:mask="0x1" edc:name="LC6D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D1S4" edc:mask="0x1" edc:name="LC6D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D1S5" edc:mask="0x1" edc:name="LC6D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D1S6" edc:mask="0x1" edc:name="LC6D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D1S7" edc:mask="0x1" edc:name="LC6D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC6SEL1" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC6SEL1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE5C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0xff" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC6D2S" edc:mask="0xff" edc:name="LC6D2S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S0" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S5" edc:mask="0x1" edc:name="D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S6" edc:mask="0x1" edc:name="D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S7" edc:mask="0x1" edc:name="D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC6D2S0" edc:mask="0x1" edc:name="LC6D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D2S1" edc:mask="0x1" edc:name="LC6D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D2S2" edc:mask="0x1" edc:name="LC6D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D2S3" edc:mask="0x1" edc:name="LC6D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D2S4" edc:mask="0x1" edc:name="LC6D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D2S5" edc:mask="0x1" edc:name="LC6D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D2S6" edc:mask="0x1" edc:name="LC6D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D2S7" edc:mask="0x1" edc:name="LC6D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC6SEL2" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC6SEL2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE5D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0xff" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC6D3S" edc:mask="0xff" edc:name="LC6D3S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S0" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S5" edc:mask="0x1" edc:name="D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S6" edc:mask="0x1" edc:name="D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D3S7" edc:mask="0x1" edc:name="D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC6D3S0" edc:mask="0x1" edc:name="LC6D3S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D3S1" edc:mask="0x1" edc:name="LC6D3S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D3S2" edc:mask="0x1" edc:name="LC6D3S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D3S3" edc:mask="0x1" edc:name="LC6D3S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D3S4" edc:mask="0x1" edc:name="LC6D3S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D3S5" edc:mask="0x1" edc:name="LC6D3S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D3S6" edc:mask="0x1" edc:name="LC6D3S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D3S7" edc:mask="0x1" edc:name="LC6D3S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC6SEL3" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC6SEL3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE5E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D4S" edc:desc="" edc:mask="0xff" edc:name="D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC6D4S" edc:mask="0xff" edc:name="LC6D4S" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D4S0" edc:mask="0x1" edc:name="D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S1" edc:mask="0x1" edc:name="D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S2" edc:mask="0x1" edc:name="D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S3" edc:mask="0x1" edc:name="D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S4" edc:mask="0x1" edc:name="D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S5" edc:mask="0x1" edc:name="D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S6" edc:mask="0x1" edc:name="D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D4S7" edc:mask="0x1" edc:name="D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC6D4S0" edc:mask="0x1" edc:name="LC6D4S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D4S1" edc:mask="0x1" edc:name="LC6D4S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D4S2" edc:mask="0x1" edc:name="LC6D4S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D4S3" edc:mask="0x1" edc:name="LC6D4S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D4S4" edc:mask="0x1" edc:name="LC6D4S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D4S5" edc:mask="0x1" edc:name="LC6D4S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D4S6" edc:mask="0x1" edc:name="LC6D4S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC6D4S7" edc:mask="0x1" edc:name="LC6D4S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC6GLS0" edc:desc="Gate logic select register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC6GLS0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE5F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1D1N" edc:desc="" edc:mask="0x1" edc:name="G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D1T" edc:desc="" edc:mask="0x1" edc:name="G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D2N" edc:desc="" edc:mask="0x1" edc:name="G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D2T" edc:desc="" edc:mask="0x1" edc:name="G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D3N" edc:desc="" edc:mask="0x1" edc:name="G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D3T" edc:desc="" edc:mask="0x1" edc:name="G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D4N" edc:desc="" edc:mask="0x1" edc:name="G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D4T" edc:desc="" edc:mask="0x1" edc:name="G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC6G1D1N" edc:desc="" edc:mask="0x1" edc:name="LC6G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G1D1T" edc:desc="" edc:mask="0x1" edc:name="LC6G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G1D2N" edc:desc="" edc:mask="0x1" edc:name="LC6G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G1D2T" edc:desc="" edc:mask="0x1" edc:name="LC6G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G1D3N" edc:desc="" edc:mask="0x1" edc:name="LC6G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G1D3T" edc:desc="" edc:mask="0x1" edc:name="LC6G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G1D4N" edc:desc="" edc:mask="0x1" edc:name="LC6G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6G1D4T" edc:desc="" edc:mask="0x1" edc:name="LC6G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
