garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T4INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T4INPPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xEA7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4INPPS0" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS1" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS2" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS3" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS4" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4INPPS" edc:mask="0x1f" edc:name="T4INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T6INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T6INPPS" edc:nzwidth="8" edc:por="---01111" edc:_addr="0xEA8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6INPPS0" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS1" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS2" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS3" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS4" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6INPPS" edc:mask="0x1f" edc:name="T6INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADACTPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ADACTPPS" edc:nzwidth="8" edc:por="---01100" edc:_addr="0xEA9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACTPPS0" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS1" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS2" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS3" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS4" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACTPPS" edc:mask="0x1f" edc:name="ADACTPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP1PPS" edc:nzwidth="8" edc:por="---10010" edc:_addr="0xEAA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1PPS0" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS1" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS2" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS3" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS4" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1PPS" edc:mask="0x1f" edc:name="CCP1PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP2PPS" edc:nzwidth="8" edc:por="---10001" edc:_addr="0xEAB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2PPS0" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS1" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS2" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS3" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS4" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2PPS" edc:mask="0x1f" edc:name="CCP2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CWG1PPS" edc:nzwidth="8" edc:por="---01000" edc:_addr="0xEAC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWGPPS"/>
            <edc:LegacyAlias edc:cname="CWG1INPPS"/>
            <edc:LegacyAlias edc:cname="CWGINPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:mask="0x1f" edc:name="CWG1INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x1f" edc:name="CWGINPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MDCARLPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="MDCARLPPS" edc:nzwidth="8" edc:por="---00011" edc:_addr="0xEAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCARLPPS0" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS1" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS2" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS3" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS4" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCARLPPS" edc:mask="0x1f" edc:name="MDCARLPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MDCARHPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="MDCARHPPS" edc:nzwidth="8" edc:por="---00100" edc:_addr="0xEAE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCARHPPS0" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS1" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS2" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS3" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS4" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCARHPPS" edc:mask="0x1f" edc:name="MDCARHPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
