garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="n------r" edc:cname="BORCON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u------u" edc:name="BORCON" edc:nzwidth="8" edc:por="1------q" edc:_addr="0xEDB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD0" edc:desc="" edc:impl="0x20" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00u00000" edc:name="PMD0" edc:nzwidth="8" edc:por="00x00000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KFAE.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEDC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCMD" edc:desc="" edc:mask="0x1" edc:name="IOCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRMD" edc:desc="" edc:mask="0x1" edc:name="CLKRMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMMD" edc:desc="" edc:mask="0x1" edc:name="NVMMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANMD" edc:desc="" edc:mask="0x1" edc:name="SCANMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCMD" edc:desc="" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDMD" edc:mask="0x1" edc:name="HLVDMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVRMD" edc:desc="" edc:mask="0x1" edc:name="FVRMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYSCMD" edc:desc="" edc:mask="0x1" edc:name="SYSCMD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PMD1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PMD1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KFAE.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEDD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0MD" edc:desc="" edc:mask="0x1" edc:name="TMR0MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5MD" edc:desc="" edc:mask="0x1" edc:name="TMR5MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6MD" edc:desc="" edc:mask="0x1" edc:name="TMR6MD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EMBMD" edc:desc="" edc:mask="0x1" edc:name="EMBMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nn--nnn" edc:cname="PMD2" edc:desc="" edc:impl="0x6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00--000" edc:name="PMD2" edc:nzwidth="8" edc:por="-00--000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KFAE.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEDE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCDMD" edc:desc="" edc:mask="0x1" edc:name="ZCDMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACMD" edc:desc="" edc:mask="0x1" edc:name="DACMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD3" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KFAE.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEDF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3MD" edc:desc="" edc:mask="0x1" edc:name="PWM3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4MD" edc:desc="" edc:mask="0x1" edc:name="PWM4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC5MD" edc:desc="" edc:mask="0x1" edc:name="CLC5MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC6MD" edc:desc="" edc:mask="0x1" edc:name="CLC6MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC7MD" edc:desc="" edc:mask="0x1" edc:name="CLC7MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC8MD" edc:desc="" edc:mask="0x1" edc:name="CLC8MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn---n" edc:cname="PMD4" edc:desc="" edc:impl="0xa1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="PMD4" edc:nzwidth="8" edc:por="0000---0" edc:_modsrc="DOS-02264-pmd-mid8-v1-KFAE.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEE0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWGMD" edc:mask="0x1" edc:name="CWGMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="MSSP1MD" edc:desc="" edc:mask="0x1" edc:name="MSSP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSSP2MD" edc:mask="0x1" edc:name="MSSP2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UART1MD" edc:desc="" edc:mask="0x1" edc:name="UART1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART2MD" edc:mask="0x1" edc:name="UART2MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1MD" edc:mask="0x1" edc:name="CWG1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn---n" edc:cname="PMD5" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="PMD5" edc:nzwidth="8" edc:por="0000---0" edc:_modsrc="DOS-02264-pmd-mid8-v1-KFAE.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEE1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSMMD" edc:desc="" edc:mask="0x1" edc:name="DSMMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CLC1MD" edc:desc="" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC2MD" edc:desc="" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC3MD" edc:desc="" edc:mask="0x1" edc:name="CLC3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC4MD" edc:desc="" edc:mask="0x1" edc:name="CLC4MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS0" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS1" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS2" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS3" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS4" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
