garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS0" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS1" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS2" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS3" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS4" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS0" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS1" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS2" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS3" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS4" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA3PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA3PPS0" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS1" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS2" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS3" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS4" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS0" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS1" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS2" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS3" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS4" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA5PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA5PPS0" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS1" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS2" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS3" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS4" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA6PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA6PPS0" edc:mask="0x1" edc:name="RA6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6PPS1" edc:mask="0x1" edc:name="RA6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6PPS2" edc:mask="0x1" edc:name="RA6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6PPS3" edc:mask="0x1" edc:name="RA6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6PPS4" edc:mask="0x1" edc:name="RA6PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA7PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEE9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA7PPS0" edc:mask="0x1" edc:name="RA7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7PPS1" edc:mask="0x1" edc:name="RA7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7PPS2" edc:mask="0x1" edc:name="RA7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7PPS3" edc:mask="0x1" edc:name="RA7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7PPS4" edc:mask="0x1" edc:name="RA7PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB0PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEEA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0PPS0" edc:mask="0x1" edc:name="RB0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0PPS1" edc:mask="0x1" edc:name="RB0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0PPS2" edc:mask="0x1" edc:name="RB0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0PPS3" edc:mask="0x1" edc:name="RB0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0PPS4" edc:mask="0x1" edc:name="RB0PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB1PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEEB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB1PPS0" edc:mask="0x1" edc:name="RB1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1PPS1" edc:mask="0x1" edc:name="RB1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1PPS2" edc:mask="0x1" edc:name="RB1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1PPS3" edc:mask="0x1" edc:name="RB1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1PPS4" edc:mask="0x1" edc:name="RB1PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB2PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEEC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB2PPS0" edc:mask="0x1" edc:name="RB2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2PPS1" edc:mask="0x1" edc:name="RB2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2PPS2" edc:mask="0x1" edc:name="RB2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2PPS3" edc:mask="0x1" edc:name="RB2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2PPS4" edc:mask="0x1" edc:name="RB2PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB3PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEED">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB3PPS0" edc:mask="0x1" edc:name="RB3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3PPS1" edc:mask="0x1" edc:name="RB3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3PPS2" edc:mask="0x1" edc:name="RB3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3PPS3" edc:mask="0x1" edc:name="RB3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3PPS4" edc:mask="0x1" edc:name="RB3PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
