garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RD4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RD4PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEFE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD4PPS0" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS1" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS2" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS3" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS4" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RD5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RD5PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xEFF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD5PPS0" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS1" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS2" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS3" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS4" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xF" edc:beginaddr="0xF00" edc:endaddr="0xF60" edc:regionid="sfr15">
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RD6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RD6PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="5" edc:_begin="0x6" edc:_end="0x8" edc:_addr="0xF00">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD6PPS0" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS1" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS2" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS3" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS4" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RD7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RD7PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="5" edc:_begin="0x6" edc:_end="0x8" edc:_addr="0xF01">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD7PPS0" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS1" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS2" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS3" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS4" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RE0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RE0PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xF02">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0PPS0" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS1" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS2" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS3" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS4" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RE1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RE1PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xF03">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE1PPS0" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS1" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS2" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS3" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS4" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RE2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RE2PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xF04">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE2PPS0" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS1" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS2" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS3" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS4" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF05">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF6" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF7" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
