garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONC" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF19">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRC0" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC1" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC2" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC3" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC4" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC5" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC6" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRC7" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF1A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCC0" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC1" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC2" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC3" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC4" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC5" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC6" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC7" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF1B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUC0" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC1" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC2" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC3" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC4" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC5" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC6" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC7" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELC" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF1C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELC0" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC1" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC2" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC3" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC4" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC5" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC6" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC7" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLD" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="4" edc:_begin="0x3" edc:_end="0x8" edc:_addr="0xF1D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLD0" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD1" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD2" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD3" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD4" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD5" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD6" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD7" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCOND" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="4" edc:_begin="0x3" edc:_end="0x8" edc:_addr="0xF1E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRD0" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD1" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD2" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD3" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD4" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD5" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD6" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD7" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCOND" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="4" edc:_begin="0x3" edc:_end="0x8" edc:_addr="0xF1F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCD0" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD1" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD2" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD3" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD4" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD5" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD6" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD7" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="4" edc:_begin="0x3" edc:_end="0x8" edc:_addr="0xF20">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUD0" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD1" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD2" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD3" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD4" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD5" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD6" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD7" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELD" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="4" edc:_begin="0x3" edc:_end="0x8" edc:_addr="0xF21">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELD0" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD1" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD2" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD3" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD4" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD5" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD6" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD7" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="IOCEF" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="IOCEF" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01613_IOC_&amp;_Port_Control_xxK40_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF22">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCEF0" edc:mask="0x1" edc:name="IOCEF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCEF1" edc:mask="0x1" edc:name="IOCEF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCEF2" edc:mask="0x1" edc:name="IOCEF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCEF3" edc:mask="0x1" edc:name="IOCEF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
