garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="nnn----n" edc:cname="ADCON1" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="000----0" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF54">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADDSEN" edc:desc="" edc:mask="0x1" edc:name="ADDSEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADGPOL" edc:desc="" edc:mask="0x1" edc:name="ADGPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADIPEN" edc:desc="" edc:mask="0x1" edc:name="ADIPEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPPOL" edc:desc="" edc:mask="0x1" edc:name="ADPPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCON2" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF55">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADMD" edc:desc="" edc:mask="0x7" edc:name="ADMD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ADACLR" edc:desc="" edc:mask="0x1" edc:name="ADACLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCRS" edc:desc="" edc:mask="0x7" edc:name="ADCRS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ADPSIS" edc:desc="" edc:mask="0x1" edc:name="ADPSIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADMD0" edc:desc="" edc:mask="0x1" edc:name="ADMD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMD1" edc:desc="" edc:mask="0x1" edc:name="ADMD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMD2" edc:desc="" edc:mask="0x1" edc:name="ADMD2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCRS0" edc:desc="" edc:mask="0x1" edc:name="ADCRS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCRS1" edc:desc="" edc:mask="0x1" edc:name="ADCRS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCRS2" edc:desc="" edc:mask="0x1" edc:name="ADCRS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="ADCON3" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="ADCON3" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF56">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADTMD" edc:mask="0x7" edc:name="ADTMD" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ADSOI" edc:mask="0x1" edc:name="ADSOI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCALC" edc:mask="0x7" edc:name="ADCALC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADTMD0" edc:desc="" edc:mask="0x1" edc:name="ADTMD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADTMD1" edc:desc="" edc:mask="0x1" edc:name="ADTMD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADTMD2" edc:desc="" edc:mask="0x1" edc:name="ADTMD2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCALC0" edc:desc="" edc:mask="0x1" edc:name="ADCALC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCALC1" edc:desc="" edc:mask="0x1" edc:name="ADCALC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCALC2" edc:desc="" edc:mask="0x1" edc:name="ADCALC2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADACQ" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADACQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF57">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACQ" edc:desc="" edc:mask="0xff" edc:name="ADACQ" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACQ0" edc:desc="" edc:mask="0x1" edc:name="ADACQ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ1" edc:desc="" edc:mask="0x1" edc:name="ADACQ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ2" edc:desc="" edc:mask="0x1" edc:name="ADACQ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ3" edc:desc="" edc:mask="0x1" edc:name="ADACQ3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ4" edc:desc="" edc:mask="0x1" edc:name="ADACQ4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ5" edc:desc="" edc:mask="0x1" edc:name="ADACQ5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ6" edc:desc="" edc:mask="0x1" edc:name="ADACQ6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ7" edc:desc="" edc:mask="0x1" edc:name="ADACQ7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
