garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:JoinedSFRDef edc:cname="ADERR" edc:desc="" edc:name="ADERR" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF69">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADERRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF69">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADERRL" edc:desc="" edc:mask="0xff" edc:name="ADERRL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR0" edc:desc="" edc:mask="0x1" edc:name="ADERR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR1" edc:desc="" edc:mask="0x1" edc:name="ADERR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR2" edc:desc="" edc:mask="0x1" edc:name="ADERR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR3" edc:desc="" edc:mask="0x1" edc:name="ADERR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR4" edc:desc="" edc:mask="0x1" edc:name="ADERR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR5" edc:desc="" edc:mask="0x1" edc:name="ADERR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR6" edc:desc="" edc:mask="0x1" edc:name="ADERR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR7" edc:desc="" edc:mask="0x1" edc:name="ADERR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADERRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF6A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADERRH" edc:desc="" edc:mask="0xff" edc:name="ADERRH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR8" edc:desc="" edc:mask="0x1" edc:name="ADERR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR9" edc:desc="" edc:mask="0x1" edc:name="ADERR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR10" edc:desc="" edc:mask="0x1" edc:name="ADERR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR11" edc:desc="" edc:mask="0x1" edc:name="ADERR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR12" edc:desc="" edc:mask="0x1" edc:name="ADERR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR13" edc:desc="" edc:mask="0x1" edc:name="ADERR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR14" edc:desc="" edc:mask="0x1" edc:name="ADERR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR15" edc:desc="" edc:mask="0x1" edc:name="ADERR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADACC" edc:desc="" edc:name="ADACC" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF6B">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADACCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF6B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADACCL" edc:desc="" edc:mask="0xff" edc:name="ADACCL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACC0" edc:desc="" edc:mask="0x1" edc:name="ADACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC1" edc:desc="" edc:mask="0x1" edc:name="ADACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC2" edc:desc="" edc:mask="0x1" edc:name="ADACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC3" edc:desc="" edc:mask="0x1" edc:name="ADACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC4" edc:desc="" edc:mask="0x1" edc:name="ADACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC5" edc:desc="" edc:mask="0x1" edc:name="ADACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC6" edc:desc="" edc:mask="0x1" edc:name="ADACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC7" edc:desc="" edc:mask="0x1" edc:name="ADACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADACCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF6C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADACCH" edc:desc="" edc:mask="0xff" edc:name="ADACCH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACC8" edc:desc="" edc:mask="0x1" edc:name="ADACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC9" edc:desc="" edc:mask="0x1" edc:name="ADACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC10" edc:desc="" edc:mask="0x1" edc:name="ADACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC11" edc:desc="" edc:mask="0x1" edc:name="ADACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC12" edc:desc="" edc:mask="0x1" edc:name="ADACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC13" edc:desc="" edc:mask="0x1" edc:name="ADACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC14" edc:desc="" edc:mask="0x1" edc:name="ADACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADACC15" edc:desc="" edc:mask="0x1" edc:name="ADACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADFLTR" edc:desc="" edc:name="ADFLTR" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF6D">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADFLTRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADFLTRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF6D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADFLTRL" edc:desc="" edc:mask="0xff" edc:name="ADFLTRL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADFLTR0" edc:desc="" edc:mask="0x1" edc:name="ADFLTR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR1" edc:desc="" edc:mask="0x1" edc:name="ADFLTR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR2" edc:desc="" edc:mask="0x1" edc:name="ADFLTR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR3" edc:desc="" edc:mask="0x1" edc:name="ADFLTR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR4" edc:desc="" edc:mask="0x1" edc:name="ADFLTR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR5" edc:desc="" edc:mask="0x1" edc:name="ADFLTR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR6" edc:desc="" edc:mask="0x1" edc:name="ADFLTR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR7" edc:desc="" edc:mask="0x1" edc:name="ADFLTR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADFLTRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADFLTRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF6E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADFLTRH" edc:desc="" edc:mask="0xff" edc:name="ADFLTRH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADFLTR8" edc:desc="" edc:mask="0x1" edc:name="ADFLTR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR9" edc:desc="" edc:mask="0x1" edc:name="ADFLTR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR10" edc:desc="" edc:mask="0x1" edc:name="ADFLTR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR11" edc:desc="" edc:mask="0x1" edc:name="ADFLTR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR12" edc:desc="" edc:mask="0x1" edc:name="ADFLTR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR13" edc:desc="" edc:mask="0x1" edc:name="ADFLTR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR14" edc:desc="" edc:mask="0x1" edc:name="ADFLTR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR15" edc:desc="" edc:mask="0x1" edc:name="ADFLTR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCDATA" edc:desc="" edc:name="CRCDATA" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF6F">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCDATL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF6F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA0" edc:desc="" edc:mask="0x1" edc:name="DATA0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA1" edc:desc="" edc:mask="0x1" edc:name="DATA1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA2" edc:desc="" edc:mask="0x1" edc:name="DATA2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA3" edc:desc="" edc:mask="0x1" edc:name="DATA3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA4" edc:desc="" edc:mask="0x1" edc:name="DATA4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA5" edc:desc="" edc:mask="0x1" edc:name="DATA5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA6" edc:desc="" edc:mask="0x1" edc:name="DATA6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA7" edc:desc="" edc:mask="0x1" edc:name="DATA7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
