garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCDATH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF70">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA8" edc:desc="" edc:mask="0x1" edc:name="DATA8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA9" edc:desc="" edc:mask="0x1" edc:name="DATA9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA10" edc:desc="" edc:mask="0x1" edc:name="DATA10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA11" edc:desc="" edc:mask="0x1" edc:name="DATA11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA12" edc:desc="" edc:mask="0x1" edc:name="DATA12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA13" edc:desc="" edc:mask="0x1" edc:name="DATA13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA14" edc:desc="" edc:mask="0x1" edc:name="DATA14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATA15" edc:desc="" edc:mask="0x1" edc:name="DATA15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCACC" edc:desc="" edc:name="CRCACC" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF71">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCACCL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF71">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC0" edc:desc="" edc:mask="0x1" edc:name="ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC1" edc:desc="" edc:mask="0x1" edc:name="ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC2" edc:desc="" edc:mask="0x1" edc:name="ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC3" edc:desc="" edc:mask="0x1" edc:name="ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC4" edc:desc="" edc:mask="0x1" edc:name="ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC5" edc:desc="" edc:mask="0x1" edc:name="ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC6" edc:desc="" edc:mask="0x1" edc:name="ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC7" edc:desc="" edc:mask="0x1" edc:name="ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCACCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF72">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC8" edc:desc="" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:desc="" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:desc="" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:desc="" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:desc="" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:desc="" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:desc="" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:desc="" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCSHFT" edc:desc="" edc:name="CRCSHFT" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF73">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHIFTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHIFTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF73">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SHFT0" edc:desc="" edc:mask="0x1" edc:name="SHFT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT1" edc:desc="" edc:mask="0x1" edc:name="SHFT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT2" edc:desc="" edc:mask="0x1" edc:name="SHFT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT3" edc:desc="" edc:mask="0x1" edc:name="SHFT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT4" edc:desc="" edc:mask="0x1" edc:name="SHFT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT5" edc:desc="" edc:mask="0x1" edc:name="SHFT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT6" edc:desc="" edc:mask="0x1" edc:name="SHFT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT7" edc:desc="" edc:mask="0x1" edc:name="SHFT7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHIFTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHIFTH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF74">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SHFT8" edc:desc="" edc:mask="0x1" edc:name="SHFT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT9" edc:desc="" edc:mask="0x1" edc:name="SHFT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT10" edc:desc="" edc:mask="0x1" edc:name="SHFT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT11" edc:desc="" edc:mask="0x1" edc:name="SHFT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT12" edc:desc="" edc:mask="0x1" edc:name="SHFT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT13" edc:desc="" edc:mask="0x1" edc:name="SHFT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT14" edc:desc="" edc:mask="0x1" edc:name="SHFT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT15" edc:desc="" edc:mask="0x1" edc:name="SHFT15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCXOR" edc:desc="" edc:name="CRCXOR" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF75">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnn-" edc:cname="CRCXORL" edc:desc="" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxx1" edc:name="CRCXORL" edc:nzwidth="8" edc:por="xxxxxxx1" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF75">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="1"/>
                <edc:SFRFieldDef edc:cname="X1" edc:desc="" edc:mask="0x1" edc:name="X1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X2" edc:desc="" edc:mask="0x1" edc:name="X2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X3" edc:desc="" edc:mask="0x1" edc:name="X3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X4" edc:desc="" edc:mask="0x1" edc:name="X4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X5" edc:desc="" edc:mask="0x1" edc:name="X5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X6" edc:desc="" edc:mask="0x1" edc:name="X6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X7" edc:desc="" edc:mask="0x1" edc:name="X7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCXORH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCXORH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF76">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="X8" edc:desc="" edc:mask="0x1" edc:name="X8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X9" edc:desc="" edc:mask="0x1" edc:name="X9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X10" edc:desc="" edc:mask="0x1" edc:name="X10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X11" edc:desc="" edc:mask="0x1" edc:name="X11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X12" edc:desc="" edc:mask="0x1" edc:name="X12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X13" edc:desc="" edc:mask="0x1" edc:name="X13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X14" edc:desc="" edc:mask="0x1" edc:name="X14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X15" edc:desc="" edc:mask="0x1" edc:name="X15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrn--nr" edc:cname="CRCCON0" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCCON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF77">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FULL" edc:desc="" edc:mask="0x1" edc:name="FULL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHIFTM" edc:desc="" edc:mask="0x1" edc:name="SHIFTM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ACCM" edc:desc="" edc:mask="0x1" edc:name="ACCM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCGO" edc:desc="" edc:mask="0x1" edc:name="CRCGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="CRCEN" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF78">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xf" edc:name="PLEN" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DLEN" edc:desc="" edc:mask="0xf" edc:name="DLEN" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLEN0" edc:desc="" edc:mask="0x1" edc:name="PLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN1" edc:desc="" edc:mask="0x1" edc:name="PLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN2" edc:desc="" edc:mask="0x1" edc:name="PLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN3" edc:desc="" edc:mask="0x1" edc:name="PLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN0" edc:desc="" edc:mask="0x1" edc:name="DLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN1" edc:desc="" edc:mask="0x1" edc:name="DLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN2" edc:desc="" edc:mask="0x1" edc:name="DLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN3" edc:desc="" edc:mask="0x1" edc:name="DLEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
