garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
        <edc:SFRDef edc:access="nnnnnnrn" edc:cname="TX1STA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010" edc:name="TX1STA" edc:nzwidth="8" edc:por="00000010" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF9D">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXSTA1"/>
            <edc:LegacyAlias edc:cname="TXSTA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rr-nn-nn" edc:cname="BAUD1CON" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01-00-00" edc:name="BAUD1CON" edc:nzwidth="8" edc:por="01-00-00" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF9E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="BAUDCON1"/>
            <edc:LegacyAlias edc:cname="BAUDCTL1"/>
            <edc:LegacyAlias edc:cname="BAUDCON"/>
            <edc:LegacyAlias edc:cname="BAUDCTL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM4DC" edc:desc="" edc:name="PWM4DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xF9F">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM4DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM4DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xF9F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM4DC0" edc:desc="" edc:mask="0x1" edc:name="PWM4DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC1" edc:desc="" edc:mask="0x1" edc:name="PWM4DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xFA0">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4DC2" edc:desc="" edc:mask="0x1" edc:name="PWM4DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC3" edc:desc="" edc:mask="0x1" edc:name="PWM4DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC4" edc:desc="" edc:mask="0x1" edc:name="PWM4DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC5" edc:desc="" edc:mask="0x1" edc:name="PWM4DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC6" edc:desc="" edc:mask="0x1" edc:name="PWM4DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC7" edc:desc="" edc:mask="0x1" edc:name="PWM4DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC8" edc:desc="" edc:mask="0x1" edc:name="PWM4DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC9" edc:desc="" edc:mask="0x1" edc:name="PWM4DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM4CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM4CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xFA1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM4POL" edc:desc="" edc:mask="0x1" edc:name="PWM4POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OUT" edc:desc="" edc:mask="0x1" edc:name="PWM4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4EN" edc:desc="" edc:mask="0x1" edc:name="PWM4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
