garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="TBLPTRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TBLPTRU" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0xFF8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TBLPTRU" edc:desc="" edc:mask="0x3f" edc:name="TBLPTRU" edc:nzwidth="6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PCLAT" edc:desc="" edc:name="PCLAT" edc:nzwidth="0x18" edc:_addr="0xFF9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLAT" edc:desc="" edc:mask="0x1fffff" edc:name="PCLAT" edc:nzwidth="0x15"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PCL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFF9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCL" edc:desc="" edc:mask="0xff" edc:name="PCL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCLATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PCLATH" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFFA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xff" edc:name="PCH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="PCLATU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PCLATU" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xFFB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCU" edc:mask="0x1f" edc:name="PCU" edc:nzwidth="5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="STKPTR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="STKPTR" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0xFFC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:mask="0x3f" edc:name="STKPTR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="STKPTR0" edc:desc="" edc:mask="0x1" edc:name="SP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STKPTR1" edc:desc="" edc:mask="0x1" edc:name="SP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STKPTR2" edc:desc="" edc:mask="0x1" edc:name="SP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STKPTR3" edc:desc="" edc:mask="0x1" edc:name="SP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STKPTR4" edc:desc="" edc:mask="0x1" edc:name="SP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STKPTR5" edc:mask="0x1" edc:name="STKPTR5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SP0" edc:desc="" edc:mask="0x1" edc:name="SP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SP1" edc:desc="" edc:mask="0x1" edc:name="SP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SP2" edc:desc="" edc:mask="0x1" edc:name="SP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SP3" edc:desc="" edc:mask="0x1" edc:name="SP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SP4" edc:desc="" edc:mask="0x1" edc:name="SP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SP5" edc:mask="0x1" edc:name="SP5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TOS" edc:desc="" edc:name="TOS" edc:nzwidth="0x18" edc:_addr="0xFFD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOS" edc:desc="" edc:mask="0x1fffff" edc:name="TOS" edc:nzwidth="0x15"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="TOSL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFFD">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TOSL" edc:desc="" edc:mask="0xff" edc:name="TOSL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
