garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F46Q10.PIC
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CWG1A" edc:ppsval="0x01"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CWG1B" edc:ppsval="0x02"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CWG1C" edc:ppsval="0x03"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CWG1D" edc:ppsval="0x04"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP1" edc:ppsval="0x05"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="0x06"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="PWM3" edc:ppsval="0x07"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PWM4" edc:ppsval="0x08"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK1" edc:ppsval="0x09"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="TX1" edc:ppsval="0x09"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="DT1" edc:ppsval="0x0A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="TX2" edc:ppsval="0x0B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CK2" edc:ppsval="0x0B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="DT2" edc:ppsval="0x0C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="0x0D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A E">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="0x0E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK1" edc:ppsval="0x0F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL1" edc:ppsval="0x0F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDO1" edc:ppsval="0x10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA1" edc:ppsval="0x10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SCK2" edc:ppsval="0x11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SCL2" edc:ppsval="0x11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SDA2" edc:ppsval="0x12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SDO2" edc:ppsval="0x12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="TMR0" edc:ppsval="0x13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLKR" edc:ppsval="0x14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="DSM" edc:ppsval="0x15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="ADGRDA" edc:ppsval="0x16"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="ADGRDB" edc:ppsval="0x17"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC1OUT" edc:ppsval="0x18"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC2OUT" edc:ppsval="0x19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC3OUT" edc:ppsval="0x1A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC4OUT" edc:ppsval="0x1B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC5OUT" edc:ppsval="0x1C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC6OUT" edc:ppsval="0x1D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC7OUT" edc:ppsval="0x1E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC8OUT" edc:ppsval="0x1F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="DT1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CK2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SDA2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SCK2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="DT2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A D">
      <edc:VirtualPin edc:name="SS1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDI1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="RX2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SDI2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="SS2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLCIN2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLCIN3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLCIN6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLCIN7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="INT0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="INT1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="INT2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T1G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T3CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T3G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T5CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="T5G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T4IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="T6IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="ADACT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CWG1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A D">
      <edc:VirtualPin edc:name="MDCARL"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A D">
      <edc:VirtualPin edc:name="MDCARH"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A D">
      <edc:VirtualPin edc:name="MDSRC"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="RX1"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
